Angle145/FSC_STOS/移植参考例程_Demo/stm32f1xx工程模板_STD/STM32F10x_工程模板V4.4/User/STM32F10x_C51Mode.h
//作者：望穿秋水
/*--------------------P口(GPIO口)输入输出模式配置----------------------------------------
使用说明：
//举例:       PA0_OUT;   //PA0配置成推挽输出模式
              PA0=1;     //PA0输出1
              ...
              PA0=0;     //PA0输出0
							
              当临时需要PA0改为输入时，需要在使用前配置成输入
							PA0_IN;    //PA0配置成上拉输入
							if(PA0in==0) PA11=1;  //读取PA0的电平状态
							当PA0作为输入使用完毕，PA0口又继续上面的输出工作，则重新再配置一次
							PA0_OUT;   //恢复PA0为推挽输出
							
							PA_OUT;    //PA(16个IO口)配置成推挽输出模式
							PA=0xFF00; //高8位输出1，低8位输出0
							PA_IN;     //PA(16个IO口)配置成上拉输入
							PB0_OUT;   //PB0配置成推挽输出模式
							if(PAin==0xFFFF)  PB0=1;   //如果PA16个IO都等于1，则PB0置1

_OUT          --推挽输出
_OUT_AF       --复用功能输出
_IN           --上拉输入  输入前，P口置1，则是上拉输入，反之是下拉输入（_IN默认是上拉）
_IN_AN        --模拟输入

PA0_OUT;      //配置单个IO口为推挽输出模式
PA0_OUT_AF;   //配置单个IO口为复用功能输出模式
PA0_IN;       //配置单个IO口为输入模式
PA0_IN_AN;    //配置单个IO口为模拟输入模式
PA_OUT;       //配置整个PA口(16个IO）为推挽输出模式
PA_IN;        //配置整个PA口(16个IO）为上拉输入模式

注：PB3，PB4(JNTRST)，PA13(SWD)，PA14(SWC)，PA15  为JTAG/SWD仿真器的调试接口(上电默认为JTAG功能,不能用于普通IO口功能)
    关闭对应的的调试接口功能才能作为普通IO口使用,调试接口调置命令如下:
    SWJ_ON();         ---SW+JTAG功能都打开(上电默认状态)
		SWJ_NOJNTRST();   ---SW+JTAG功能都打开,但是不用JTAG复位引脚(PB4)，PB4用作普通IO口功能
		SWON_JTAGOFF();   ---SW功能打开，JTAG功能关闭，                   PB3,PB4,PA15用作普通IO口功能
		SWJ_OFF();        ---SW+JTAG功能都关闭,但能用ST-LINK,             PB3,PB4,PA13,PA14,PA15用作普通IO口功能
		
----------------------------------------------------------------------------------*/
#ifndef _STM32F10x_C51Mode_H_
#define _STM32F10x_C51Mode_H_

#define BITBAND(addr, bitnum) ((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2))
#define MEM_ADDR(addr) *((volatile unsigned long *)(addr))
#define BIT_ADDR(addr, bitnum) MEM_ADDR(BITBAND(addr, bitnum))
#define GPIOA_ODR_Addr (GPIOA_BASE+0x0C) //0x4001080C
#define GPIOB_ODR_Addr (GPIOB_BASE+0x0C) //0x40010C0C
#define GPIOC_ODR_Addr (GPIOC_BASE+0x0C) //0x4001100C
#define GPIOD_ODR_Addr (GPIOD_BASE+0x0C) //0x4001140C
#define GPIOE_ODR_Addr (GPIOE_BASE+0x0C) //0x4001180C
#define GPIOF_ODR_Addr (GPIOF_BASE+0x0C) //0x40011808
#define GPIOG_ODR_Addr (GPIOG_BASE+0x0C) //0x40011808
#define GPIOA_IDR_Addr (GPIOA_BASE+0x08) //0x40010808
#define GPIOB_IDR_Addr (GPIOB_BASE+0x08) //0x40010C08  
#define GPIOC_IDR_Addr (GPIOC_BASE+0x08) //0x40011008
#define GPIOD_IDR_Addr (GPIOD_BASE+0x08) //0x40011408
#define GPIOE_IDR_Addr (GPIOE_BASE+0x08) //0x40011808
#define GPIOF_IDR_Addr (GPIOF_BASE+0x08) //0x40011808
#define GPIOG_IDR_Addr (GPIOG_BASE+0x08) //0x40011808
//-----------------------------------------------------

/*--------------------------------------------------------------------------------*/
#define PA0_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFFFFF0; GPIOA->CRL|=0x00000003;GPIOA->ODR|=1<<0;  }
#define PA1_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFFFF0F; GPIOA->CRL|=0x00000030;GPIOA->ODR|=1<<1;  }
#define PA2_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFFF0FF; GPIOA->CRL|=0x00000300;GPIOA->ODR|=1<<2;  }
#define PA3_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFF0FFF; GPIOA->CRL|=0x00003000;GPIOA->ODR|=1<<3;  }
#define PA4_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFF0FFFF; GPIOA->CRL|=0x00030000;GPIOA->ODR|=1<<4;  }
#define PA5_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFF0FFFFF; GPIOA->CRL|=0x00300000;GPIOA->ODR|=1<<5;  }
#define PA6_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xF0FFFFFF; GPIOA->CRL|=0x03000000;GPIOA->ODR|=1<<6;  }
#define PA7_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0x0FFFFFFF; GPIOA->CRL|=0x30000000;GPIOA->ODR|=1<<7;  }
#define PA8_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFFFFF0; GPIOA->CRH|=0x00000003;GPIOA->ODR|=1<<8;  }
#define PA9_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFFFF0F; GPIOA->CRH|=0x00000030;GPIOA->ODR|=1<<9;  }
#define PA10_OUT { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFFF0FF; GPIOA->CRH|=0x00000300;GPIOA->ODR|=1<<10; }
#define PA11_OUT { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFF0FFF; GPIOA->CRH|=0x00003000;GPIOA->ODR|=1<<11; }
#define PA12_OUT { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFF0FFFF; GPIOA->CRH|=0x00030000;GPIOA->ODR|=1<<12; }
#define PA13_OUT { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFF0FFFFF; GPIOA->CRH|=0x00300000;GPIOA->ODR|=1<<13; }
#define PA14_OUT { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xF0FFFFFF; GPIOA->CRH|=0x03000000;GPIOA->ODR|=1<<14; }
#define PA15_OUT { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0x0FFFFFFF; GPIOA->CRH|=0x30000000;GPIOA->ODR|=1<<15; }
#define PA0_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFFFFF0; GPIOA->CRL|=0x00000008;GPIOA->ODR|=1<<0;  }
#define PA1_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFFFF0F; GPIOA->CRL|=0x00000080;GPIOA->ODR|=1<<1;  }
#define PA2_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFFF0FF; GPIOA->CRL|=0x00000800;GPIOA->ODR|=1<<2;  }
#define PA3_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFFF0FFF; GPIOA->CRL|=0x00008000;GPIOA->ODR|=1<<3;  }
#define PA4_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFFF0FFFF; GPIOA->CRL|=0x00080000;GPIOA->ODR|=1<<4;  }
#define PA5_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xFF0FFFFF; GPIOA->CRL|=0x00800000;GPIOA->ODR|=1<<5;  }
#define PA6_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0xF0FFFFFF; GPIOA->CRL|=0x08000000;GPIOA->ODR|=1<<6;  }
#define PA7_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0x0FFFFFFF; GPIOA->CRL|=0x80000000;GPIOA->ODR|=1<<7;  }
#define PA8_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFFFFF0; GPIOA->CRH|=0x00000008;GPIOA->ODR|=1<<8;  }
#define PA9_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFFFF0F; GPIOA->CRH|=0x00000080;GPIOA->ODR|=1<<9;  }
#define PA10_IN  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFFF0FF; GPIOA->CRH|=0x00000800;GPIOA->ODR|=1<<10; }
#define PA11_IN  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFFF0FFF; GPIOA->CRH|=0x00008000;GPIOA->ODR|=1<<11; }
#define PA12_IN  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFFF0FFFF; GPIOA->CRH|=0x00080000;GPIOA->ODR|=1<<12; }
#define PA13_IN  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xFF0FFFFF; GPIOA->CRH|=0x00800000;GPIOA->ODR|=1<<13; }
#define PA14_IN  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0xF0FFFFFF; GPIOA->CRH|=0x08000000;GPIOA->ODR|=1<<14; }
#define PA15_IN  { RCC->APB2ENR|=1<<2;GPIOA->CRH&=0x0FFFFFFF; GPIOA->CRH|=0x80000000;GPIOA->ODR|=1<<15; }
//-----------------------------------------------------
#define PB0_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFFFFF0; GPIOB->CRL|=0x00000003;GPIOB->ODR|=1<<0;  }
#define PB1_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFFFF0F; GPIOB->CRL|=0x00000030;GPIOB->ODR|=1<<1;  }
#define PB2_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFFF0FF; GPIOB->CRL|=0x00000300;GPIOB->ODR|=1<<2;  }
#define PB3_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFF0FFF; GPIOB->CRL|=0x00003000;GPIOB->ODR|=1<<3;  }
#define PB4_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFF0FFFF; GPIOB->CRL|=0x00030000;GPIOB->ODR|=1<<4;  }
#define PB5_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFF0FFFFF; GPIOB->CRL|=0x00300000;GPIOB->ODR|=1<<5;  }
#define PB6_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xF0FFFFFF; GPIOB->CRL|=0x03000000;GPIOB->ODR|=1<<6;  }
#define PB7_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0x0FFFFFFF; GPIOB->CRL|=0x30000000;GPIOB->ODR|=1<<7;  }
#define PB8_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFFFFF0; GPIOB->CRH|=0x00000003;GPIOB->ODR|=1<<8;  }
#define PB9_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFFFF0F; GPIOB->CRH|=0x00000030;GPIOB->ODR|=1<<9;  }
#define PB10_OUT { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFFF0FF; GPIOB->CRH|=0x00000300;GPIOB->ODR|=1<<10; }
#define PB11_OUT { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFF0FFF; GPIOB->CRH|=0x00003000;GPIOB->ODR|=1<<11; }
#define PB12_OUT { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFF0FFFF; GPIOB->CRH|=0x00030000;GPIOB->ODR|=1<<12; }
#define PB13_OUT { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFF0FFFFF; GPIOB->CRH|=0x00300000;GPIOB->ODR|=1<<13; }
#define PB14_OUT { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xF0FFFFFF; GPIOB->CRH|=0x03000000;GPIOB->ODR|=1<<14; }
#define PB15_OUT { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0x0FFFFFFF; GPIOB->CRH|=0x30000000;GPIOB->ODR|=1<<15; }
#define PB0_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFFFFF0; GPIOB->CRL|=0x00000008;GPIOB->ODR|=1<<0;  }
#define PB1_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFFFF0F; GPIOB->CRL|=0x00000080;GPIOB->ODR|=1<<1;  }
#define PB2_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFFF0FF; GPIOB->CRL|=0x00000800;GPIOB->ODR|=1<<2;  }
#define PB3_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFFF0FFF; GPIOB->CRL|=0x00008000;GPIOB->ODR|=1<<3;  }
#define PB4_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFFF0FFFF; GPIOB->CRL|=0x00080000;GPIOB->ODR|=1<<4;  }
#define PB5_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xFF0FFFFF; GPIOB->CRL|=0x00800000;GPIOB->ODR|=1<<5;  }
#define PB6_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0xF0FFFFFF; GPIOB->CRL|=0x08000000;GPIOB->ODR|=1<<6;  }
#define PB7_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0x0FFFFFFF; GPIOB->CRL|=0x80000000;GPIOB->ODR|=1<<7;  }
#define PB8_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFFFFF0; GPIOB->CRH|=0x00000008;GPIOB->ODR|=1<<8;  }
#define PB9_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFFFF0F; GPIOB->CRH|=0x00000080;GPIOB->ODR|=1<<9;  }
#define PB10_IN  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFFF0FF; GPIOB->CRH|=0x00000800;GPIOB->ODR|=1<<10; }
#define PB11_IN  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFFF0FFF; GPIOB->CRH|=0x00008000;GPIOB->ODR|=1<<11; }
#define PB12_IN  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFFF0FFFF; GPIOB->CRH|=0x00080000;GPIOB->ODR|=1<<12; }
#define PB13_IN  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xFF0FFFFF; GPIOB->CRH|=0x00800000;GPIOB->ODR|=1<<13; }
#define PB14_IN  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0xF0FFFFFF; GPIOB->CRH|=0x08000000;GPIOB->ODR|=1<<14; }
#define PB15_IN  { RCC->APB2ENR|=1<<3;GPIOB->CRH&=0x0FFFFFFF; GPIOB->CRH|=0x80000000;GPIOB->ODR|=1<<15; }
//----------------------------------------------------
#define PC0_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFFFFF0; GPIOC->CRL|=0x00000003;GPIOC->ODR|=1<<0;  }
#define PC1_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFFFF0F; GPIOC->CRL|=0x00000030;GPIOC->ODR|=1<<1;  }
#define PC2_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFFF0FF; GPIOC->CRL|=0x00000300;GPIOC->ODR|=1<<2;  }
#define PC3_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFF0FFF; GPIOC->CRL|=0x00003000;GPIOC->ODR|=1<<3;  }
#define PC4_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFF0FFFF; GPIOC->CRL|=0x00030000;GPIOC->ODR|=1<<4;  }
#define PC5_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFF0FFFFF; GPIOC->CRL|=0x00300000;GPIOC->ODR|=1<<5;  }
#define PC6_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xF0FFFFFF; GPIOC->CRL|=0x03000000;GPIOC->ODR|=1<<6;  }
#define PC7_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0x0FFFFFFF; GPIOC->CRL|=0x30000000;GPIOC->ODR|=1<<7;  }
#define PC8_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFFFFF0; GPIOC->CRH|=0x00000003;GPIOC->ODR|=1<<8;  }
#define PC9_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFFFF0F; GPIOC->CRH|=0x00000030;GPIOC->ODR|=1<<9;  }
#define PC10_OUT { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFFF0FF; GPIOC->CRH|=0x00000300;GPIOC->ODR|=1<<10; }
#define PC11_OUT { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFF0FFF; GPIOC->CRH|=0x00003000;GPIOC->ODR|=1<<11; }
#define PC12_OUT { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFF0FFFF; GPIOC->CRH|=0x00030000;GPIOC->ODR|=1<<12; }
#define PC13_OUT { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFF0FFFFF; GPIOC->CRH|=0x00300000;GPIOC->ODR|=1<<13; }
#define PC14_OUT { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xF0FFFFFF; GPIOC->CRH|=0x03000000;GPIOC->ODR|=1<<14; }
#define PC15_OUT { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0x0FFFFFFF; GPIOC->CRH|=0x30000000;GPIOC->ODR|=1<<15; }
#define PC0_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFFFFF0; GPIOC->CRL|=0x00000008;GPIOC->ODR|=1<<0;  }
#define PC1_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFFFF0F; GPIOC->CRL|=0x00000080;GPIOC->ODR|=1<<1;  }
#define PC2_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFFF0FF; GPIOC->CRL|=0x00000800;GPIOC->ODR|=1<<2;  }
#define PC3_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFFF0FFF; GPIOC->CRL|=0x00008000;GPIOC->ODR|=1<<3;  }
#define PC4_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFFF0FFFF; GPIOC->CRL|=0x00080000;GPIOC->ODR|=1<<4;  }
#define PC5_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xFF0FFFFF; GPIOC->CRL|=0x00800000;GPIOC->ODR|=1<<5;  }
#define PC6_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0xF0FFFFFF; GPIOC->CRL|=0x08000000;GPIOC->ODR|=1<<6;  }
#define PC7_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0x0FFFFFFF; GPIOC->CRL|=0x80000000;GPIOC->ODR|=1<<7;  }
#define PC8_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFFFFF0; GPIOC->CRH|=0x00000008;GPIOC->ODR|=1<<8;  }
#define PC9_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFFFF0F; GPIOC->CRH|=0x00000080;GPIOC->ODR|=1<<9;  }
#define PC10_IN  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFFF0FF; GPIOC->CRH|=0x00000800;GPIOC->ODR|=1<<10; }
#define PC11_IN  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFFF0FFF; GPIOC->CRH|=0x00008000;GPIOC->ODR|=1<<11; }
#define PC12_IN  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFFF0FFFF; GPIOC->CRH|=0x00080000;GPIOC->ODR|=1<<12; }
#define PC13_IN  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xFF0FFFFF; GPIOC->CRH|=0x00800000;GPIOC->ODR|=1<<13; }
#define PC14_IN  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0xF0FFFFFF; GPIOC->CRH|=0x08000000;GPIOC->ODR|=1<<14; }
#define PC15_IN  { RCC->APB2ENR|=1<<4;GPIOC->CRH&=0x0FFFFFFF; GPIOC->CRH|=0x80000000;GPIOC->ODR|=1<<15; }
//----------------------------------------------------
#define PD0_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFFFFF0; GPIOD->CRL|=0x00000003;GPIOD->ODR|=1<<0;  }
#define PD1_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFFFF0F; GPIOD->CRL|=0x00000030;GPIOD->ODR|=1<<1;  }
#define PD2_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFFF0FF; GPIOD->CRL|=0x00000300;GPIOD->ODR|=1<<2;  }
#define PD3_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFF0FFF; GPIOD->CRL|=0x00003000;GPIOD->ODR|=1<<3;  }
#define PD4_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFF0FFFF; GPIOD->CRL|=0x00030000;GPIOD->ODR|=1<<4;  }
#define PD5_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFF0FFFFF; GPIOD->CRL|=0x00300000;GPIOD->ODR|=1<<5;  }
#define PD6_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xF0FFFFFF; GPIOD->CRL|=0x03000000;GPIOD->ODR|=1<<6;  }
#define PD7_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0x0FFFFFFF; GPIOD->CRL|=0x30000000;GPIOD->ODR|=1<<7;  }
#define PD8_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFFFFF0; GPIOD->CRH|=0x00000003;GPIOD->ODR|=1<<8;  }
#define PD9_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFFFF0F; GPIOD->CRH|=0x00000030;GPIOD->ODR|=1<<9;  }
#define PD10_OUT { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFFF0FF; GPIOD->CRH|=0x00000300;GPIOD->ODR|=1<<10; }
#define PD11_OUT { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFF0FFF; GPIOD->CRH|=0x00003000;GPIOD->ODR|=1<<11; }
#define PD12_OUT { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFF0FFFF; GPIOD->CRH|=0x00030000;GPIOD->ODR|=1<<12; }
#define PD13_OUT { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFF0FFFFF; GPIOD->CRH|=0x00300000;GPIOD->ODR|=1<<13; }
#define PD14_OUT { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xF0FFFFFF; GPIOD->CRH|=0x03000000;GPIOD->ODR|=1<<14; }
#define PD15_OUT { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0x0FFFFFFF; GPIOD->CRH|=0x30000000;GPIOD->ODR|=1<<15; }
#define PD0_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFFFFF0; GPIOD->CRL|=0x00000008;GPIOD->ODR|=1<<0;  }
#define PD1_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFFFF0F; GPIOD->CRL|=0x00000080;GPIOD->ODR|=1<<1;  }
#define PD2_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFFF0FF; GPIOD->CRL|=0x00000800;GPIOD->ODR|=1<<2;  }
#define PD3_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFFF0FFF; GPIOD->CRL|=0x00008000;GPIOD->ODR|=1<<3;  }
#define PD4_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFFF0FFFF; GPIOD->CRL|=0x00080000;GPIOD->ODR|=1<<4;  }
#define PD5_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xFF0FFFFF; GPIOD->CRL|=0x00800000;GPIOD->ODR|=1<<5;  }
#define PD6_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0xF0FFFFFF; GPIOD->CRL|=0x08000000;GPIOD->ODR|=1<<6;  }
#define PD7_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0x0FFFFFFF; GPIOD->CRL|=0x80000000;GPIOD->ODR|=1<<7;  }
#define PD8_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFFFFF0; GPIOD->CRH|=0x00000008;GPIOD->ODR|=1<<8;  }
#define PD9_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFFFF0F; GPIOD->CRH|=0x00000080;GPIOD->ODR|=1<<9;  }
#define PD10_IN  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFFF0FF; GPIOD->CRH|=0x00000800;GPIOD->ODR|=1<<10; }
#define PD11_IN  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFFF0FFF; GPIOD->CRH|=0x00008000;GPIOD->ODR|=1<<11; }
#define PD12_IN  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFFF0FFFF; GPIOD->CRH|=0x00080000;GPIOD->ODR|=1<<12; }
#define PD13_IN  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xFF0FFFFF; GPIOD->CRH|=0x00800000;GPIOD->ODR|=1<<13; }
#define PD14_IN  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0xF0FFFFFF; GPIOD->CRH|=0x08000000;GPIOD->ODR|=1<<14; }
#define PD15_IN  { RCC->APB2ENR|=1<<5;GPIOD->CRH&=0x0FFFFFFF; GPIOD->CRH|=0x80000000;GPIOD->ODR|=1<<15; }
//----------------------------------------------------
#define PE0_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFFFFF0; GPIOE->CRL|=0x00000003;GPIOE->ODR|=1<<0;  }
#define PE1_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFFFF0F; GPIOE->CRL|=0x00000030;GPIOE->ODR|=1<<1;  }
#define PE2_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFFF0FF; GPIOE->CRL|=0x00000300;GPIOE->ODR|=1<<2;  }
#define PE3_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFF0FFF; GPIOE->CRL|=0x00003000;GPIOE->ODR|=1<<3;  }
#define PE4_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFF0FFFF; GPIOE->CRL|=0x00030000;GPIOE->ODR|=1<<4;  }
#define PE5_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFF0FFFFF; GPIOE->CRL|=0x00300000;GPIOE->ODR|=1<<5;  }
#define PE6_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xF0FFFFFF; GPIOE->CRL|=0x03000000;GPIOE->ODR|=1<<6;  }
#define PE7_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0x0FFFFFFF; GPIOE->CRL|=0x30000000;GPIOE->ODR|=1<<7;  }
#define PE8_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFFFFF0; GPIOE->CRH|=0x00000003;GPIOE->ODR|=1<<8;  }
#define PE9_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFFFF0F; GPIOE->CRH|=0x00000030;GPIOE->ODR|=1<<9;  }
#define PE10_OUT { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFFF0FF; GPIOE->CRH|=0x00000300;GPIOE->ODR|=1<<10; }
#define PE11_OUT { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFF0FFF; GPIOE->CRH|=0x00003000;GPIOE->ODR|=1<<11; }
#define PE12_OUT { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFF0FFFF; GPIOE->CRH|=0x00030000;GPIOE->ODR|=1<<12; }
#define PE13_OUT { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFF0FFFFF; GPIOE->CRH|=0x00300000;GPIOE->ODR|=1<<13; }
#define PE14_OUT { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xF0FFFFFF; GPIOE->CRH|=0x03000000;GPIOE->ODR|=1<<14; }
#define PE15_OUT { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0x0FFFFFFF; GPIOE->CRH|=0x30000000;GPIOE->ODR|=1<<15; }
#define PE0_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFFFFF0; GPIOE->CRL|=0x00000008;GPIOE->ODR|=1<<0;  }
#define PE1_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFFFF0F; GPIOE->CRL|=0x00000080;GPIOE->ODR|=1<<1;  }
#define PE2_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFFF0FF; GPIOE->CRL|=0x00000800;GPIOE->ODR|=1<<2;  }
#define PE3_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFFF0FFF; GPIOE->CRL|=0x00008000;GPIOE->ODR|=1<<3;  }
#define PE4_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFFF0FFFF; GPIOE->CRL|=0x00080000;GPIOE->ODR|=1<<4;  }
#define PE5_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xFF0FFFFF; GPIOE->CRL|=0x00800000;GPIOE->ODR|=1<<5;  }
#define PE6_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0xF0FFFFFF; GPIOE->CRL|=0x08000000;GPIOE->ODR|=1<<6;  }
#define PE7_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0x0FFFFFFF; GPIOE->CRL|=0x80000000;GPIOE->ODR|=1<<7;  }
#define PE8_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFFFFF0; GPIOE->CRH|=0x00000008;GPIOE->ODR|=1<<8;  }
#define PE9_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFFFF0F; GPIOE->CRH|=0x00000080;GPIOE->ODR|=1<<9;  }
#define PE10_IN  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFFF0FF; GPIOE->CRH|=0x00000800;GPIOE->ODR|=1<<10; }
#define PE11_IN  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFFF0FFF; GPIOE->CRH|=0x00008000;GPIOE->ODR|=1<<11; }
#define PE12_IN  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFFF0FFFF; GPIOE->CRH|=0x00080000;GPIOE->ODR|=1<<12; }
#define PE13_IN  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xFF0FFFFF; GPIOE->CRH|=0x00800000;GPIOE->ODR|=1<<13; }
#define PE14_IN  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0xF0FFFFFF; GPIOE->CRH|=0x08000000;GPIOE->ODR|=1<<14; }
#define PE15_IN  { RCC->APB2ENR|=1<<6;GPIOE->CRH&=0x0FFFFFFF; GPIOE->CRH|=0x80000000;GPIOE->ODR|=1<<15; }
//----------------------------------------------------
#define PF0_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFFFFF0; GPIOF->CRL|=0x00000003;GPIOF->ODR|=1<<0;  }
#define PF1_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFFFF0F; GPIOF->CRL|=0x00000030;GPIOF->ODR|=1<<1;  }
#define PF2_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFFF0FF; GPIOF->CRL|=0x00000300;GPIOF->ODR|=1<<2;  }
#define PF3_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFF0FFF; GPIOF->CRL|=0x00003000;GPIOF->ODR|=1<<3;  }
#define PF4_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFF0FFFF; GPIOF->CRL|=0x00030000;GPIOF->ODR|=1<<4;  }
#define PF5_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFF0FFFFF; GPIOF->CRL|=0x00300000;GPIOF->ODR|=1<<5;  }
#define PF6_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xF0FFFFFF; GPIOF->CRL|=0x03000000;GPIOF->ODR|=1<<6;  }
#define PF7_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0x0FFFFFFF; GPIOF->CRL|=0x30000000;GPIOF->ODR|=1<<7;  }
#define PF8_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFFFFF0; GPIOF->CRH|=0x00000003;GPIOF->ODR|=1<<8;  }
#define PF9_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFFFF0F; GPIOF->CRH|=0x00000030;GPIOF->ODR|=1<<9;  }
#define PF10_OUT { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFFF0FF; GPIOF->CRH|=0x00000300;GPIOF->ODR|=1<<10; }
#define PF11_OUT { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFF0FFF; GPIOF->CRH|=0x00003000;GPIOF->ODR|=1<<11; }
#define PF12_OUT { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFF0FFFF; GPIOF->CRH|=0x00030000;GPIOF->ODR|=1<<12; }
#define PF13_OUT { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFF0FFFFF; GPIOF->CRH|=0x00300000;GPIOF->ODR|=1<<13; }
#define PF14_OUT { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xF0FFFFFF; GPIOF->CRH|=0x03000000;GPIOF->ODR|=1<<14; }
#define PF15_OUT { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0x0FFFFFFF; GPIOF->CRH|=0x30000000;GPIOF->ODR|=1<<15; }
#define PF0_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFFFFF0; GPIOF->CRL|=0x00000008;GPIOF->ODR|=1<<0;  }
#define PF1_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFFFF0F; GPIOF->CRL|=0x00000080;GPIOF->ODR|=1<<1;  }
#define PF2_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFFF0FF; GPIOF->CRL|=0x00000800;GPIOF->ODR|=1<<2;  }
#define PF3_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFFF0FFF; GPIOF->CRL|=0x00008000;GPIOF->ODR|=1<<3;  }
#define PF4_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFFF0FFFF; GPIOF->CRL|=0x00080000;GPIOF->ODR|=1<<4;  }
#define PF5_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xFF0FFFFF; GPIOF->CRL|=0x00800000;GPIOF->ODR|=1<<5;  }
#define PF6_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0xF0FFFFFF; GPIOF->CRL|=0x08000000;GPIOF->ODR|=1<<6;  }
#define PF7_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0x0FFFFFFF; GPIOF->CRL|=0x80000000;GPIOF->ODR|=1<<7;  }
#define PF8_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFFFFF0; GPIOF->CRH|=0x00000008;GPIOF->ODR|=1<<8;  }
#define PF9_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFFFF0F; GPIOF->CRH|=0x00000080;GPIOF->ODR|=1<<9;  }
#define PF10_IN  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFFF0FF; GPIOF->CRH|=0x00000800;GPIOF->ODR|=1<<10; }
#define PF11_IN  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFFF0FFF; GPIOF->CRH|=0x00008000;GPIOF->ODR|=1<<11; }
#define PF12_IN  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFFF0FFFF; GPIOF->CRH|=0x00080000;GPIOF->ODR|=1<<12; }
#define PF13_IN  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xFF0FFFFF; GPIOF->CRH|=0x00800000;GPIOF->ODR|=1<<13; }
#define PF14_IN  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0xF0FFFFFF; GPIOF->CRH|=0x08000000;GPIOF->ODR|=1<<14; }
#define PF15_IN  { RCC->APB2ENR|=1<<6;GPIOF->CRH&=0x0FFFFFFF; GPIOF->CRH|=0x80000000;GPIOF->ODR|=1<<15; }
//----------------------------------------------------
#define PG0_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFFFFF0; GPIOG->CRL|=0x00000003;GPIOG->ODR|=1<<0;  }
#define PG1_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFFFF0F; GPIOG->CRL|=0x00000030;GPIOG->ODR|=1<<1;  }
#define PG2_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFFF0FF; GPIOG->CRL|=0x00000300;GPIOG->ODR|=1<<2;  }
#define PG3_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFF0FFF; GPIOG->CRL|=0x00003000;GPIOG->ODR|=1<<3;  }
#define PG4_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFF0FFFF; GPIOG->CRL|=0x00030000;GPIOG->ODR|=1<<4;  }
#define PG5_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFF0FFFFF; GPIOG->CRL|=0x00300000;GPIOG->ODR|=1<<5;  }
