Angle145/FSC_STOS/移植参考例程_Demo/stm32f1xx工程模板_STD/STM32F10x_工程模板V4.4/User/STM32F10x_C51Mode.h
#define PG6_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xF0FFFFFF; GPIOG->CRL|=0x03000000;GPIOG->ODR|=1<<6;  }
#define PG7_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0x0FFFFFFF; GPIOG->CRL|=0x30000000;GPIOG->ODR|=1<<7;  }
#define PG8_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFFFFF0; GPIOG->CRH|=0x00000003;GPIOG->ODR|=1<<8;  }
#define PG9_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFFFF0F; GPIOG->CRH|=0x00000030;GPIOG->ODR|=1<<9;  }
#define PG10_OUT { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFFF0FF; GPIOG->CRH|=0x00000300;GPIOG->ODR|=1<<10; }
#define PG11_OUT { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFF0FFF; GPIOG->CRH|=0x00003000;GPIOG->ODR|=1<<11; }
#define PG12_OUT { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFF0FFFF; GPIOG->CRH|=0x00030000;GPIOG->ODR|=1<<12; }
#define PG13_OUT { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFF0FFFFF; GPIOG->CRH|=0x00300000;GPIOG->ODR|=1<<13; }
#define PG14_OUT { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xF0FFFFFF; GPIOG->CRH|=0x03000000;GPIOG->ODR|=1<<14; }
#define PG15_OUT { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0x0FFFFFFF; GPIOG->CRH|=0x30000000;GPIOG->ODR|=1<<15; }
#define PG0_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFFFFF0; GPIOG->CRL|=0x00000008;GPIOG->ODR|=1<<0;  }
#define PG1_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFFFF0F; GPIOG->CRL|=0x00000080;GPIOG->ODR|=1<<1;  }
#define PG2_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFFF0FF; GPIOG->CRL|=0x00000800;GPIOG->ODR|=1<<2;  }
#define PG3_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFFF0FFF; GPIOG->CRL|=0x00008000;GPIOG->ODR|=1<<3;  }
#define PG4_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFFF0FFFF; GPIOG->CRL|=0x00080000;GPIOG->ODR|=1<<4;  }
#define PG5_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xFF0FFFFF; GPIOG->CRL|=0x00800000;GPIOG->ODR|=1<<5;  }
#define PG6_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0xF0FFFFFF; GPIOG->CRL|=0x08000000;GPIOG->ODR|=1<<6;  }
#define PG7_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0x0FFFFFFF; GPIOG->CRL|=0x80000000;GPIOG->ODR|=1<<7;  }
#define PG8_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFFFFF0; GPIOG->CRH|=0x00000008;GPIOG->ODR|=1<<8;  }
#define PG9_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFFFF0F; GPIOG->CRH|=0x00000080;GPIOG->ODR|=1<<9;  }
#define PG10_IN  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFFF0FF; GPIOG->CRH|=0x00000800;GPIOG->ODR|=1<<10; }
#define PG11_IN  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFFF0FFF; GPIOG->CRH|=0x00008000;GPIOG->ODR|=1<<11; }
#define PG12_IN  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFFF0FFFF; GPIOG->CRH|=0x00080000;GPIOG->ODR|=1<<12; }
#define PG13_IN  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xFF0FFFFF; GPIOG->CRH|=0x00800000;GPIOG->ODR|=1<<13; }
#define PG14_IN  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0xF0FFFFFF; GPIOG->CRH|=0x08000000;GPIOG->ODR|=1<<14; }
#define PG15_IN  { RCC->APB2ENR|=1<<6;GPIOG->CRH&=0x0FFFFFFF; GPIOG->CRH|=0x80000000;GPIOG->ODR|=1<<15; }

#define PA0_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xFFFFFFF0; GPIOA->CRL|=0x0000000B; } 
#define PA1_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xFFFFFF0F; GPIOA->CRL|=0x000000B0; }
#define PA2_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xFFFFF0FF; GPIOA->CRL|=0x00000B00; }
#define PA3_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xFFFF0FFF; GPIOA->CRL|=0x0000B000; }
#define PA4_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xFFF0FFFF; GPIOA->CRL|=0x000B0000; }
#define PA5_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xFF0FFFFF; GPIOA->CRL|=0x00B00000; }
#define PA6_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0xF0FFFFFF; GPIOA->CRL|=0x0B000000; }
#define PA7_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRL&=0x0FFFFFFF; GPIOA->CRL|=0xB0000000; }
#define PA8_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xFFFFFFF0; GPIOA->CRH|=0x0000000B; }
#define PA9_OUT_AF  { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xFFFFFF0F; GPIOA->CRH|=0x000000B0; }
#define PA10_OUT_AF { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xFFFFF0FF; GPIOA->CRH|=0x00000B00; }
#define PA11_OUT_AF { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xFFFF0FFF; GPIOA->CRH|=0x0000B000; }
#define PA12_OUT_AF { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xFFF0FFFF; GPIOA->CRH|=0x000B0000; }
#define PA13_OUT_AF { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xFF0FFFFF; GPIOA->CRH|=0x00B00000; }
#define PA14_OUT_AF { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0xF0FFFFFF; GPIOA->CRH|=0x0B000000; }
#define PA15_OUT_AF { RCC->APB2ENR|=(1<<2)|1;GPIOA->CRH&=0x0FFFFFFF; GPIOA->CRH|=0xB0000000; }
#define PA0_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xFFFFFFF0; GPIOA->CRL|=0x00000000; }
#define PA1_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xFFFFFF0F; GPIOA->CRL|=0x00000000; }
#define PA2_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xFFFFF0FF; GPIOA->CRL|=0x00000000; }
#define PA3_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xFFFF0FFF; GPIOA->CRL|=0x00000000; }
#define PA4_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xFFF0FFFF; GPIOA->CRL|=0x00000000; }
#define PA5_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xFF0FFFFF; GPIOA->CRL|=0x00000000; }
#define PA6_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0xF0FFFFFF; GPIOA->CRL|=0x00000000; }
#define PA7_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRL&=0x0FFFFFFF; GPIOA->CRL|=0x00000000; }
#define PA8_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xFFFFFFF0; GPIOA->CRH|=0x00000000; }
#define PA9_IN_AN   { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xFFFFFF0F; GPIOA->CRH|=0x00000000; }
#define PA10_IN_AN  { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xFFFFF0FF; GPIOA->CRH|=0x00000000; }
#define PA11_IN_AN  { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xFFFF0FFF; GPIOA->CRH|=0x00000000; }
#define PA12_IN_AN  { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xFFF0FFFF; GPIOA->CRH|=0x00000000; }
#define PA13_IN_AN  { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xFF0FFFFF; GPIOA->CRH|=0x00000000; }
#define PA14_IN_AN  { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0xF0FFFFFF; GPIOA->CRH|=0x00000000; }
#define PA15_IN_AN  { RCC->APB2ENR|= 1<<2   ;GPIOA->CRH&=0x0FFFFFFF; GPIOA->CRH|=0x00000000; }
//-----------------------------------------------------
#define PB0_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xFFFFFFF0; GPIOB->CRL|=0x0000000B; }
#define PB1_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xFFFFFF0F; GPIOB->CRL|=0x000000B0; }
#define PB2_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xFFFFF0FF; GPIOB->CRL|=0x00000B00; }
#define PB3_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xFFFF0FFF; GPIOB->CRL|=0x0000B000; }
#define PB4_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xFFF0FFFF; GPIOB->CRL|=0x000B0000; }
#define PB5_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xFF0FFFFF; GPIOB->CRL|=0x00B00000; }
#define PB6_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0xF0FFFFFF; GPIOB->CRL|=0x0B000000; }
#define PB7_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRL&=0x0FFFFFFF; GPIOB->CRL|=0xB0000000; }
#define PB8_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xFFFFFFF0; GPIOB->CRH|=0x0000000B; }
#define PB9_OUT_AF  { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xFFFFFF0F; GPIOB->CRH|=0x000000B0; }
#define PB10_OUT_AF { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xFFFFF0FF; GPIOB->CRH|=0x00000B00; }
#define PB11_OUT_AF { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xFFFF0FFF; GPIOB->CRH|=0x0000B000; }
#define PB12_OUT_AF { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xFFF0FFFF; GPIOB->CRH|=0x000B0000; }
#define PB13_OUT_AF { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xFF0FFFFF; GPIOB->CRH|=0x00B00000; }
#define PB14_OUT_AF { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0xF0FFFFFF; GPIOB->CRH|=0x0B000000; }
#define PB15_OUT_AF { RCC->APB2ENR|=(1<<3)|1;GPIOB->CRH&=0x0FFFFFFF; GPIOB->CRH|=0xB0000000; }
#define PB0_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xFFFFFFF0; GPIOB->CRL|=0x00000000; }
#define PB1_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xFFFFFF0F; GPIOB->CRL|=0x00000000; }
#define PB2_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xFFFFF0FF; GPIOB->CRL|=0x00000000; }
#define PB3_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xFFFF0FFF; GPIOB->CRL|=0x00000000; }
#define PB4_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xFFF0FFFF; GPIOB->CRL|=0x00000000; }
#define PB5_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xFF0FFFFF; GPIOB->CRL|=0x00000000; }
#define PB6_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0xF0FFFFFF; GPIOB->CRL|=0x00000000; }
#define PB7_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRL&=0x0FFFFFFF; GPIOB->CRL|=0x00000000; }
#define PB8_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xFFFFFFF0; GPIOB->CRH|=0x00000000; }
#define PB9_IN_AN   { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xFFFFFF0F; GPIOB->CRH|=0x00000000; }
#define PB10_IN_AN  { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xFFFFF0FF; GPIOB->CRH|=0x00000000; }
#define PB11_IN_AN  { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xFFFF0FFF; GPIOB->CRH|=0x00000000; }
#define PB12_IN_AN  { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xFFF0FFFF; GPIOB->CRH|=0x00000000; }
#define PB13_IN_AN  { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xFF0FFFFF; GPIOB->CRH|=0x00000000; }
#define PB14_IN_AN  { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0xF0FFFFFF; GPIOB->CRH|=0x00000000; }
#define PB15_IN_AN  { RCC->APB2ENR|= 1<<3   ;GPIOB->CRH&=0x0FFFFFFF; GPIOB->CRH|=0x00000000; }
//----------------------------------------------------
#define PC0_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xFFFFFFF0; GPIOC->CRL|=0x0000000B; }
#define PC1_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xFFFFFF0F; GPIOC->CRL|=0x000000B0; }
#define PC2_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xFFFFF0FF; GPIOC->CRL|=0x00000B00; }
#define PC3_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xFFFF0FFF; GPIOC->CRL|=0x0000B000; }
#define PC4_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xFFF0FFFF; GPIOC->CRL|=0x000B0000; }
#define PC5_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xFF0FFFFF; GPIOC->CRL|=0x00B00000; }
#define PC6_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0xF0FFFFFF; GPIOC->CRL|=0x0B000000; }
#define PC7_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRL&=0x0FFFFFFF; GPIOC->CRL|=0xB0000000; }
#define PC8_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xFFFFFFF0; GPIOC->CRH|=0x0000000B; }
#define PC9_OUT_AF  { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xFFFFFF0F; GPIOC->CRH|=0x000000B0; }
#define PC10_OUT_AF { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xFFFFF0FF; GPIOC->CRH|=0x00000B00; }
#define PC11_OUT_AF { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xFFFF0FFF; GPIOC->CRH|=0x0000B000; }
#define PC12_OUT_AF { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xFFF0FFFF; GPIOC->CRH|=0x000B0000; }
#define PC13_OUT_AF { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xFF0FFFFF; GPIOC->CRH|=0x00B00000; }
#define PC14_OUT_AF { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0xF0FFFFFF; GPIOC->CRH|=0x0B000000; }
#define PC15_OUT_AF { RCC->APB2ENR|=(1<<4)|1;GPIOC->CRH&=0x0FFFFFFF; GPIOC->CRH|=0xB0000000; }
#define PC0_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xFFFFFFF0; GPIOC->CRL|=0x00000000; }
#define PC1_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xFFFFFF0F; GPIOC->CRL|=0x00000000; }
#define PC2_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xFFFFF0FF; GPIOC->CRL|=0x00000000; }
#define PC3_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xFFFF0FFF; GPIOC->CRL|=0x00000000; }
#define PC4_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xFFF0FFFF; GPIOC->CRL|=0x00000000; }
#define PC5_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xFF0FFFFF; GPIOC->CRL|=0x00000000; }
#define PC6_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0xF0FFFFFF; GPIOC->CRL|=0x00000000; }
#define PC7_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRL&=0x0FFFFFFF; GPIOC->CRL|=0x00000000; }
#define PC8_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xFFFFFFF0; GPIOC->CRH|=0x00000000; }
#define PC9_IN_AN   { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xFFFFFF0F; GPIOC->CRH|=0x00000000; }
#define PC10_IN_AN  { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xFFFFF0FF; GPIOC->CRH|=0x00000000; }
#define PC11_IN_AN  { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xFFFF0FFF; GPIOC->CRH|=0x00000000; }
#define PC12_IN_AN  { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xFFF0FFFF; GPIOC->CRH|=0x00000000; }
#define PC13_IN_AN  { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xFF0FFFFF; GPIOC->CRH|=0x00000000; }
#define PC14_IN_AN  { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0xF0FFFFFF; GPIOC->CRH|=0x00000000; }
#define PC15_IN_AN  { RCC->APB2ENR|= 1<<4   ;GPIOC->CRH&=0x0FFFFFFF; GPIOC->CRH|=0x00000000; }
//----------------------------------------------------
#define PD0_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xFFFFFFF0; GPIOD->CRL|=0x0000000B; }
#define PD1_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xFFFFFF0F; GPIOD->CRL|=0x000000B0; }
#define PD2_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xFFFFF0FF; GPIOD->CRL|=0x00000B00; }
#define PD3_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xFFFF0FFF; GPIOD->CRL|=0x0000B000; }
#define PD4_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xFFF0FFFF; GPIOD->CRL|=0x000B0000; }
#define PD5_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xFF0FFFFF; GPIOD->CRL|=0x00B00000; }
#define PD6_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0xF0FFFFFF; GPIOD->CRL|=0x0B000000; }
#define PD7_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRL&=0x0FFFFFFF; GPIOD->CRL|=0xB0000000; }
#define PD8_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xFFFFFFF0; GPIOD->CRH|=0x0000000B; }
#define PD9_OUT_AF  { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xFFFFFF0F; GPIOD->CRH|=0x000000B0; }
#define PD10_OUT_AF { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xFFFFF0FF; GPIOD->CRH|=0x00000B00; }
#define PD11_OUT_AF { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xFFFF0FFF; GPIOD->CRH|=0x0000B000; }
#define PD12_OUT_AF { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xFFF0FFFF; GPIOD->CRH|=0x000B0000; }
#define PD13_OUT_AF { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xFF0FFFFF; GPIOD->CRH|=0x00B00000; }
#define PD14_OUT_AF { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0xF0FFFFFF; GPIOD->CRH|=0x0B000000; }
#define PD15_OUT_AF { RCC->APB2ENR|=(1<<5)|1;GPIOD->CRH&=0x0FFFFFFF; GPIOD->CRH|=0xB0000000; }
#define PD0_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xFFFFFFF0; GPIOD->CRL|=0x00000000; }
#define PD1_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xFFFFFF0F; GPIOD->CRL|=0x00000000; }
#define PD2_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xFFFFF0FF; GPIOD->CRL|=0x00000000; }
#define PD3_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xFFFF0FFF; GPIOD->CRL|=0x00000000; }
#define PD4_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xFFF0FFFF; GPIOD->CRL|=0x00000000; }
#define PD5_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xFF0FFFFF; GPIOD->CRL|=0x00000000; }
#define PD6_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0xF0FFFFFF; GPIOD->CRL|=0x00000000; }
#define PD7_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRL&=0x0FFFFFFF; GPIOD->CRL|=0x00000000; }
#define PD8_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xFFFFFFF0; GPIOD->CRH|=0x00000000; }
#define PD9_IN_AN   { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xFFFFFF0F; GPIOD->CRH|=0x00000000; }
#define PD10_IN_AN  { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xFFFFF0FF; GPIOD->CRH|=0x00000000; }
#define PD11_IN_AN  { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xFFFF0FFF; GPIOD->CRH|=0x00000000; }
#define PD12_IN_AN  { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xFFF0FFFF; GPIOD->CRH|=0x00000000; }
#define PD13_IN_AN  { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xFF0FFFFF; GPIOD->CRH|=0x00000000; }
#define PD14_IN_AN  { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0xF0FFFFFF; GPIOD->CRH|=0x00000000; }
#define PD15_IN_AN  { RCC->APB2ENR|= 1<<5   ;GPIOD->CRH&=0x0FFFFFFF; GPIOD->CRH|=0x00000000; }
//----------------------------------------------------
#define PE0_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xFFFFFFF0; GPIOE->CRL|=0x0000000B; }
#define PE1_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xFFFFFF0F; GPIOE->CRL|=0x000000B0; }
#define PE2_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xFFFFF0FF; GPIOE->CRL|=0x00000B00; }
#define PE3_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xFFFF0FFF; GPIOE->CRL|=0x0000B000; }
#define PE4_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xFFF0FFFF; GPIOE->CRL|=0x000B0000; }
#define PE5_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xFF0FFFFF; GPIOE->CRL|=0x00B00000; }
#define PE6_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0xF0FFFFFF; GPIOE->CRL|=0x0B000000; }
#define PE7_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRL&=0x0FFFFFFF; GPIOE->CRL|=0xB0000000; }
#define PE8_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xFFFFFFF0; GPIOE->CRH|=0x0000000B; }
#define PE9_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xFFFFFF0F; GPIOE->CRH|=0x000000B0; }
#define PE10_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xFFFFF0FF; GPIOE->CRH|=0x00000B00; }
#define PE11_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xFFFF0FFF; GPIOE->CRH|=0x0000B000; }
#define PE12_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xFFF0FFFF; GPIOE->CRH|=0x000B0000; }
#define PE13_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xFF0FFFFF; GPIOE->CRH|=0x00B00000; }
#define PE14_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0xF0FFFFFF; GPIOE->CRH|=0x0B000000; }
#define PE15_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOE->CRH&=0x0FFFFFFF; GPIOE->CRH|=0xB0000000; }
#define PE0_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xFFFFFFF0; GPIOE->CRL|=0x00000000; }
#define PE1_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xFFFFFF0F; GPIOE->CRL|=0x00000000; }
#define PE2_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xFFFFF0FF; GPIOE->CRL|=0x00000000; }
#define PE3_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xFFFF0FFF; GPIOE->CRL|=0x00000000; }
#define PE4_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xFFF0FFFF; GPIOE->CRL|=0x00000000; }
#define PE5_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xFF0FFFFF; GPIOE->CRL|=0x00000000; }
#define PE6_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0xF0FFFFFF; GPIOE->CRL|=0x00000000; }
#define PE7_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRL&=0x0FFFFFFF; GPIOE->CRL|=0x00000000; }
#define PE8_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xFFFFFFF0; GPIOE->CRH|=0x00000000; }
#define PE9_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xFFFFFF0F; GPIOE->CRH|=0x00000000; }
#define PE10_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xFFFFF0FF; GPIOE->CRH|=0x00000000; }
#define PE11_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xFFFF0FFF; GPIOE->CRH|=0x00000000; }
#define PE12_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xFFF0FFFF; GPIOE->CRH|=0x00000000; }
#define PE13_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xFF0FFFFF; GPIOE->CRH|=0x00000000; }
#define PE14_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0xF0FFFFFF; GPIOE->CRH|=0x00000000; }
#define PE15_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOE->CRH&=0x0FFFFFFF; GPIOE->CRH|=0x00000000; }
//----------------------------------------------------
#define PF0_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xFFFFFFF0; GPIOF->CRL|=0x0000000B; }
#define PF1_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xFFFFFF0F; GPIOF->CRL|=0x000000B0; }
#define PF2_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xFFFFF0FF; GPIOF->CRL|=0x00000B00; }
#define PF3_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xFFFF0FFF; GPIOF->CRL|=0x0000B000; }
#define PF4_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xFFF0FFFF; GPIOF->CRL|=0x000B0000; }
#define PF5_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xFF0FFFFF; GPIOF->CRL|=0x00B00000; }
#define PF6_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0xF0FFFFFF; GPIOF->CRL|=0x0B000000; }
#define PF7_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRL&=0x0FFFFFFF; GPIOF->CRL|=0xB0000000; }
#define PF8_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xFFFFFFF0; GPIOF->CRH|=0x0000000B; }
#define PF9_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xFFFFFF0F; GPIOF->CRH|=0x000000B0; }
#define PF10_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xFFFFF0FF; GPIOF->CRH|=0x00000B00; }
#define PF11_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xFFFF0FFF; GPIOF->CRH|=0x0000B000; }
#define PF12_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xFFF0FFFF; GPIOF->CRH|=0x000B0000; }
#define PF13_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xFF0FFFFF; GPIOF->CRH|=0x00B00000; }
#define PF14_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0xF0FFFFFF; GPIOF->CRH|=0x0B000000; }
#define PF15_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOF->CRH&=0x0FFFFFFF; GPIOF->CRH|=0xB0000000; }
#define PF0_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xFFFFFFF0; GPIOF->CRL|=0x00000000; }
#define PF1_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xFFFFFF0F; GPIOF->CRL|=0x00000000; }
#define PF2_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xFFFFF0FF; GPIOF->CRL|=0x00000000; }
#define PF3_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xFFFF0FFF; GPIOF->CRL|=0x00000000; }
#define PF4_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xFFF0FFFF; GPIOF->CRL|=0x00000000; }
#define PF5_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xFF0FFFFF; GPIOF->CRL|=0x00000000; }
#define PF6_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0xF0FFFFFF; GPIOF->CRL|=0x00000000; }
#define PF7_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRL&=0x0FFFFFFF; GPIOF->CRL|=0x00000000; }
#define PF8_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xFFFFFFF0; GPIOF->CRH|=0x00000000; }
#define PF9_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xFFFFFF0F; GPIOF->CRH|=0x00000000; }
#define PF10_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xFFFFF0FF; GPIOF->CRH|=0x00000000; }
#define PF11_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xFFFF0FFF; GPIOF->CRH|=0x00000000; }
#define PF12_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xFFF0FFFF; GPIOF->CRH|=0x00000000; }
#define PF13_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xFF0FFFFF; GPIOF->CRH|=0x00000000; }
#define PF14_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0xF0FFFFFF; GPIOF->CRH|=0x00000000; }
#define PF15_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOF->CRH&=0x0FFFFFFF; GPIOF->CRH|=0x00000000; }
//----------------------------------------------------
#define PG0_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xFFFFFFF0; GPIOG->CRL|=0x0000000B; }
#define PG1_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xFFFFFF0F; GPIOG->CRL|=0x000000B0; }
#define PG2_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xFFFFF0FF; GPIOG->CRL|=0x00000B00; }
#define PG3_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xFFFF0FFF; GPIOG->CRL|=0x0000B000; }
#define PG4_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xFFF0FFFF; GPIOG->CRL|=0x000B0000; }
#define PG5_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xFF0FFFFF; GPIOG->CRL|=0x00B00000; }
#define PG6_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0xF0FFFFFF; GPIOG->CRL|=0x0B000000; }
#define PG7_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRL&=0x0FFFFFFF; GPIOG->CRL|=0xB0000000; }
#define PG8_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xFFFFFFF0; GPIOG->CRH|=0x0000000B; }
#define PG9_OUT_AF  { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xFFFFFF0F; GPIOG->CRH|=0x000000B0; }
#define PG10_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xFFFFF0FF; GPIOG->CRH|=0x00000B00; }
#define PG11_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xFFFF0FFF; GPIOG->CRH|=0x0000B000; }
#define PG12_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xFFF0FFFF; GPIOG->CRH|=0x000B0000; }
#define PG13_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xFF0FFFFF; GPIOG->CRH|=0x00B00000; }
#define PG14_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0xF0FFFFFF; GPIOG->CRH|=0x0B000000; }
#define PG15_OUT_AF { RCC->APB2ENR|=(1<<6)|1;GPIOG->CRH&=0x0FFFFFFF; GPIOG->CRH|=0xB0000000; }
#define PG0_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xFFFFFFF0; GPIOG->CRL|=0x00000000; }
#define PG1_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xFFFFFF0F; GPIOG->CRL|=0x00000000; }
#define PG2_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xFFFFF0FF; GPIOG->CRL|=0x00000000; }
#define PG3_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xFFFF0FFF; GPIOG->CRL|=0x00000000; }
#define PG4_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xFFF0FFFF; GPIOG->CRL|=0x00000000; }
#define PG5_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xFF0FFFFF; GPIOG->CRL|=0x00000000; }
#define PG6_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0xF0FFFFFF; GPIOG->CRL|=0x00000000; }
#define PG7_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRL&=0x0FFFFFFF; GPIOG->CRL|=0x00000000; }
#define PG8_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xFFFFFFF0; GPIOG->CRH|=0x00000000; }
#define PG9_IN_AN   { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xFFFFFF0F; GPIOG->CRH|=0x00000000; }
#define PG10_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xFFFFF0FF; GPIOG->CRH|=0x00000000; }
#define PG11_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xFFFF0FFF; GPIOG->CRH|=0x00000000; }
