Angle145/FSC_STOS/移植参考例程_Demo/stm32f1xx工程模板_STD/STM32F10x_工程模板V4.4/User/STM32F10x_C51Mode.h
#define PG12_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xFFF0FFFF; GPIOG->CRH|=0x00000000; }
#define PG13_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xFF0FFFFF; GPIOG->CRH|=0x00000000; }
#define PG14_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0xF0FFFFFF; GPIOG->CRH|=0x00000000; }
#define PG15_IN_AN  { RCC->APB2ENR|= 1<<6   ;GPIOG->CRH&=0x0FFFFFFF; GPIOG->CRH|=0x00000000; }

#define PA_OUT  { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0x00000000; GPIOA->CRL|=0x33333333;GPIOA->CRH&=0x00000000; GPIOA->CRH|=0x33333333; }
#define PB_OUT  { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0x00000000; GPIOB->CRL|=0x33333333;GPIOB->CRH&=0x00000000; GPIOB->CRH|=0x33333333; }
#define PC_OUT  { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0x00000000; GPIOC->CRL|=0x33333333;GPIOC->CRH&=0x00000000; GPIOC->CRH|=0x33333333; }
#define PD_OUT  { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0x00000000; GPIOD->CRL|=0x33333333;GPIOD->CRH&=0x00000000; GPIOD->CRH|=0x33333333; }
#define PE_OUT  { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0x00000000; GPIOE->CRL|=0x33333333;GPIOE->CRH&=0x00000000; GPIOE->CRH|=0x33333333; }
#define PF_OUT  { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0x00000000; GPIOF->CRL|=0x33333333;GPIOF->CRH&=0x00000000; GPIOF->CRH|=0x33333333; }
#define PG_OUT  { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0x00000000; GPIOG->CRL|=0x33333333;GPIOG->CRH&=0x00000000; GPIOG->CRH|=0x33333333; }
#define PA_IN   { RCC->APB2ENR|=1<<2;GPIOA->CRL&=0x00000000; GPIOA->CRL|=0x88888888;GPIOA->CRH&=0x00000000; GPIOA->CRH|=0x88888888; }
#define PB_IN   { RCC->APB2ENR|=1<<3;GPIOB->CRL&=0x00000000; GPIOB->CRL|=0x88888888;GPIOB->CRH&=0x00000000; GPIOB->CRH|=0x88888888; }
#define PC_IN   { RCC->APB2ENR|=1<<4;GPIOC->CRL&=0x00000000; GPIOC->CRL|=0x88888888;GPIOC->CRH&=0x00000000; GPIOC->CRH|=0x88888888; }
#define PD_IN   { RCC->APB2ENR|=1<<5;GPIOD->CRL&=0x00000000; GPIOD->CRL|=0x88888888;GPIOD->CRH&=0x00000000; GPIOD->CRH|=0x88888888; }
#define PE_IN   { RCC->APB2ENR|=1<<6;GPIOE->CRL&=0x00000000; GPIOE->CRL|=0x88888888;GPIOE->CRH&=0x00000000; GPIOE->CRH|=0x88888888; }
#define PF_IN   { RCC->APB2ENR|=1<<6;GPIOF->CRL&=0x00000000; GPIOF->CRL|=0x88888888;GPIOF->CRH&=0x00000000; GPIOF->CRH|=0x88888888; }
#define PG_IN   { RCC->APB2ENR|=1<<6;GPIOG->CRL&=0x00000000; GPIOG->CRL|=0x88888888;GPIOG->CRH&=0x00000000; GPIOG->CRH|=0x88888888; }

#define PA0    BIT_ADDR(GPIOA_ODR_Addr, 0) //输出
#define PA1    BIT_ADDR(GPIOA_ODR_Addr, 1) //输出
#define PA2    BIT_ADDR(GPIOA_ODR_Addr, 2) //输出
#define PA3    BIT_ADDR(GPIOA_ODR_Addr, 3) //输出
#define PA4    BIT_ADDR(GPIOA_ODR_Addr, 4) //输出
#define PA5    BIT_ADDR(GPIOA_ODR_Addr, 5) //输出
#define PA6    BIT_ADDR(GPIOA_ODR_Addr, 6) //输出
#define PA7    BIT_ADDR(GPIOA_ODR_Addr, 7) //输出
#define PA8    BIT_ADDR(GPIOA_ODR_Addr, 8) //输出
#define PA9    BIT_ADDR(GPIOA_ODR_Addr, 9) //输出
#define PA10   BIT_ADDR(GPIOA_ODR_Addr, 10) //输出
#define PA11   BIT_ADDR(GPIOA_ODR_Addr, 11) //输出
#define PA12   BIT_ADDR(GPIOA_ODR_Addr, 12) //输出
#define PA13   BIT_ADDR(GPIOA_ODR_Addr, 13) //输出
#define PA14   BIT_ADDR(GPIOA_ODR_Addr, 14) //输出
#define PA15   BIT_ADDR(GPIOA_ODR_Addr, 15) //输出
#define PA0in  BIT_ADDR(GPIOA_IDR_Addr, 0) //输入
#define PA1in  BIT_ADDR(GPIOA_IDR_Addr, 1) //输入
#define PA2in  BIT_ADDR(GPIOA_IDR_Addr, 2) //输入
#define PA3in  BIT_ADDR(GPIOA_IDR_Addr, 3) //输入
#define PA4in  BIT_ADDR(GPIOA_IDR_Addr, 4) //输入
#define PA5in  BIT_ADDR(GPIOA_IDR_Addr, 5) //输入
#define PA6in  BIT_ADDR(GPIOA_IDR_Addr, 6) //输入
#define PA7in  BIT_ADDR(GPIOA_IDR_Addr, 7) //输入
#define PA8in  BIT_ADDR(GPIOA_IDR_Addr, 8) //输入
#define PA9in  BIT_ADDR(GPIOA_IDR_Addr, 9) //输入
#define PA10in BIT_ADDR(GPIOA_IDR_Addr, 10) //输入
#define PA11in BIT_ADDR(GPIOA_IDR_Addr, 11) //输入
#define PA12in BIT_ADDR(GPIOA_IDR_Addr, 12) //输入
#define PA13in BIT_ADDR(GPIOA_IDR_Addr, 13) //输入
#define PA14in BIT_ADDR(GPIOA_IDR_Addr, 14) //输入
#define PA15in BIT_ADDR(GPIOA_IDR_Addr, 15) //输入
//-------------
#define PB0    BIT_ADDR(GPIOB_ODR_Addr, 0) //输出
#define PB1    BIT_ADDR(GPIOB_ODR_Addr, 1) //输出
#define PB2    BIT_ADDR(GPIOB_ODR_Addr, 2) //输出
#define PB3    BIT_ADDR(GPIOB_ODR_Addr, 3) //输出
#define PB4    BIT_ADDR(GPIOB_ODR_Addr, 4) //输出
#define PB5    BIT_ADDR(GPIOB_ODR_Addr, 5) //输出
#define PB6    BIT_ADDR(GPIOB_ODR_Addr, 6) //输出
#define PB7    BIT_ADDR(GPIOB_ODR_Addr, 7) //输出
#define PB8    BIT_ADDR(GPIOB_ODR_Addr, 8) //输出
#define PB9    BIT_ADDR(GPIOB_ODR_Addr, 9) //输出
#define PB10   BIT_ADDR(GPIOB_ODR_Addr, 10) //输出
#define PB11   BIT_ADDR(GPIOB_ODR_Addr, 11) //输出
#define PB12   BIT_ADDR(GPIOB_ODR_Addr, 12) //输出
#define PB13   BIT_ADDR(GPIOB_ODR_Addr, 13) //输出
#define PB14   BIT_ADDR(GPIOB_ODR_Addr, 14) //输出
#define PB15   BIT_ADDR(GPIOB_ODR_Addr, 15) //输出
#define PB0in  BIT_ADDR(GPIOB_IDR_Addr, 0) //输入
#define PB1in  BIT_ADDR(GPIOB_IDR_Addr, 1) //输入
#define PB2in  BIT_ADDR(GPIOB_IDR_Addr, 2) //输入
#define PB3in  BIT_ADDR(GPIOB_IDR_Addr, 3) //输入
#define PB4in  BIT_ADDR(GPIOB_IDR_Addr, 4) //输入
#define PB5in  BIT_ADDR(GPIOB_IDR_Addr, 5) //输入
#define PB6in  BIT_ADDR(GPIOB_IDR_Addr, 6) //输入
#define PB7in  BIT_ADDR(GPIOB_IDR_Addr, 7) //输入
#define PB8in  BIT_ADDR(GPIOB_IDR_Addr, 8) //输入
#define PB9in  BIT_ADDR(GPIOB_IDR_Addr, 9) //输入
#define PB10in BIT_ADDR(GPIOB_IDR_Addr, 10) //输入
#define PB11in BIT_ADDR(GPIOB_IDR_Addr, 11) //输入
#define PB12in BIT_ADDR(GPIOB_IDR_Addr, 12) //输入
#define PB13in BIT_ADDR(GPIOB_IDR_Addr, 13) //输入
#define PB14in BIT_ADDR(GPIOB_IDR_Addr, 14) //输入
#define PB15in BIT_ADDR(GPIOB_IDR_Addr, 15) //输入
//-------------
#define PC0    BIT_ADDR(GPIOC_ODR_Addr, 0) //输出
#define PC1    BIT_ADDR(GPIOC_ODR_Addr, 1) //输出
#define PC2    BIT_ADDR(GPIOC_ODR_Addr, 2) //输出
#define PC3    BIT_ADDR(GPIOC_ODR_Addr, 3) //输出
#define PC4    BIT_ADDR(GPIOC_ODR_Addr, 4) //输出
#define PC5    BIT_ADDR(GPIOC_ODR_Addr, 5) //输出
#define PC6    BIT_ADDR(GPIOC_ODR_Addr, 6) //输出
#define PC7    BIT_ADDR(GPIOC_ODR_Addr, 7) //输出
#define PC8    BIT_ADDR(GPIOC_ODR_Addr, 8) //输出
#define PC9    BIT_ADDR(GPIOC_ODR_Addr, 9) //输出
#define PC10   BIT_ADDR(GPIOC_ODR_Addr, 10) //输出
#define PC11   BIT_ADDR(GPIOC_ODR_Addr, 11) //输出
#define PC12   BIT_ADDR(GPIOC_ODR_Addr, 12) //输出
#define PC13   BIT_ADDR(GPIOC_ODR_Addr, 13) //输出
#define PC14   BIT_ADDR(GPIOC_ODR_Addr, 14) //输出
#define PC15   BIT_ADDR(GPIOC_ODR_Addr, 15) //输出
#define PC0in  BIT_ADDR(GPIOC_IDR_Addr, 0) //输入
#define PC1in  BIT_ADDR(GPIOC_IDR_Addr, 1) //输入
#define PC2in  BIT_ADDR(GPIOC_IDR_Addr, 2) //输入
#define PC3in  BIT_ADDR(GPIOC_IDR_Addr, 3) //输入
#define PC4in  BIT_ADDR(GPIOC_IDR_Addr, 4) //输入
#define PC5in  BIT_ADDR(GPIOC_IDR_Addr, 5) //输入
#define PC6in  BIT_ADDR(GPIOC_IDR_Addr, 6) //输入
#define PC7in  BIT_ADDR(GPIOC_IDR_Addr, 7) //输入
#define PC8in  BIT_ADDR(GPIOC_IDR_Addr, 8) //输入
#define PC9in  BIT_ADDR(GPIOC_IDR_Addr, 9) //输入
#define PC10in BIT_ADDR(GPIOC_IDR_Addr, 10) //输入
#define PC11in BIT_ADDR(GPIOC_IDR_Addr, 11) //输入
#define PC12in BIT_ADDR(GPIOC_IDR_Addr, 12) //输入
#define PC13in BIT_ADDR(GPIOC_IDR_Addr, 13) //输入
#define PC14in BIT_ADDR(GPIOC_IDR_Addr, 14) //输入
#define PC15in BIT_ADDR(GPIOC_IDR_Addr, 15) //输入
//-------------
#define PD0    BIT_ADDR(GPIOD_ODR_Addr, 0) //输出
#define PD1    BIT_ADDR(GPIOD_ODR_Addr, 1) //输出
#define PD2    BIT_ADDR(GPIOD_ODR_Addr, 2) //输出
#define PD3    BIT_ADDR(GPIOD_ODR_Addr, 3) //输出
#define PD4    BIT_ADDR(GPIOD_ODR_Addr, 4) //输出
#define PD5    BIT_ADDR(GPIOD_ODR_Addr, 5) //输出
#define PD6    BIT_ADDR(GPIOD_ODR_Addr, 6) //输出
#define PD7    BIT_ADDR(GPIOD_ODR_Addr, 7) //输出
#define PD8    BIT_ADDR(GPIOD_ODR_Addr, 8) //输出
#define PD9    BIT_ADDR(GPIOD_ODR_Addr, 9) //输出
#define PD10   BIT_ADDR(GPIOD_ODR_Addr, 10) //输出
#define PD11   BIT_ADDR(GPIOD_ODR_Addr, 11) //输出
#define PD12   BIT_ADDR(GPIOD_ODR_Addr, 12) //输出
#define PD13   BIT_ADDR(GPIOD_ODR_Addr, 13) //输出
#define PD14   BIT_ADDR(GPIOD_ODR_Addr, 14) //输出
#define PD15   BIT_ADDR(GPIOD_ODR_Addr, 15) //输出
#define PD0in  BIT_ADDR(GPIOD_IDR_Addr, 0) //输入
#define PD1in  BIT_ADDR(GPIOD_IDR_Addr, 1) //输入
#define PD2in  BIT_ADDR(GPIOD_IDR_Addr, 2) //输入
#define PD3in  BIT_ADDR(GPIOD_IDR_Addr, 3) //输入
#define PD4in  BIT_ADDR(GPIOD_IDR_Addr, 4) //输入
#define PD5in  BIT_ADDR(GPIOD_IDR_Addr, 5) //输入
#define PD6in  BIT_ADDR(GPIOD_IDR_Addr, 6) //输入
#define PD7in  BIT_ADDR(GPIOD_IDR_Addr, 7) //输入
#define PD8in  BIT_ADDR(GPIOD_IDR_Addr, 8) //输入
#define PD9in  BIT_ADDR(GPIOD_IDR_Addr, 9) //输入
#define PD10in BIT_ADDR(GPIOD_IDR_Addr, 10) //输入
#define PD11in BIT_ADDR(GPIOD_IDR_Addr, 11) //输入
#define PD12in BIT_ADDR(GPIOD_IDR_Addr, 12) //输入
#define PD13in BIT_ADDR(GPIOD_IDR_Addr, 13) //输入
#define PD14in BIT_ADDR(GPIOD_IDR_Addr, 14) //输入
#define PD15in BIT_ADDR(GPIOD_IDR_Addr, 15) //输入
//-------------
#define PE0    BIT_ADDR(GPIOE_ODR_Addr, 0) //输出
#define PE1    BIT_ADDR(GPIOE_ODR_Addr, 1) //输出
#define PE2    BIT_ADDR(GPIOE_ODR_Addr, 2) //输出
#define PE3    BIT_ADDR(GPIOE_ODR_Addr, 3) //输出
#define PE4    BIT_ADDR(GPIOE_ODR_Addr, 4) //输出
#define PE5    BIT_ADDR(GPIOE_ODR_Addr, 5) //输出
#define PE6    BIT_ADDR(GPIOE_ODR_Addr, 6) //输出
#define PE7    BIT_ADDR(GPIOE_ODR_Addr, 7) //输出
#define PE8    BIT_ADDR(GPIOE_ODR_Addr, 8) //输出
#define PE9    BIT_ADDR(GPIOE_ODR_Addr, 9) //输出
#define PE10   BIT_ADDR(GPIOE_ODR_Addr, 10) //输出
#define PE11   BIT_ADDR(GPIOE_ODR_Addr, 11) //输出
#define PE12   BIT_ADDR(GPIOE_ODR_Addr, 12) //输出
#define PE13   BIT_ADDR(GPIOE_ODR_Addr, 13) //输出
#define PE14   BIT_ADDR(GPIOE_ODR_Addr, 14) //输出
#define PE15   BIT_ADDR(GPIOE_ODR_Addr, 15) //输出
#define PE0in  BIT_ADDR(GPIOE_IDR_Addr, 0) //输入
#define PE1in  BIT_ADDR(GPIOE_IDR_Addr, 1) //输入
#define PE2in  BIT_ADDR(GPIOE_IDR_Addr, 2) //输入
#define PE3in  BIT_ADDR(GPIOE_IDR_Addr, 3) //输入
#define PE4in  BIT_ADDR(GPIOE_IDR_Addr, 4) //输入
#define PE5in  BIT_ADDR(GPIOE_IDR_Addr, 5) //输入
#define PE6in  BIT_ADDR(GPIOE_IDR_Addr, 6) //输入
#define PE7in  BIT_ADDR(GPIOE_IDR_Addr, 7) //输入
#define PE8in  BIT_ADDR(GPIOE_IDR_Addr, 8) //输入
#define PE9in  BIT_ADDR(GPIOE_IDR_Addr, 9) //输入
#define PE10in BIT_ADDR(GPIOE_IDR_Addr, 10) //输入
#define PE11in BIT_ADDR(GPIOE_IDR_Addr, 11) //输入
#define PE12in BIT_ADDR(GPIOE_IDR_Addr, 12) //输入
#define PE13in BIT_ADDR(GPIOE_IDR_Addr, 13) //输入
#define PE14in BIT_ADDR(GPIOE_IDR_Addr, 14) //输入
#define PE15in BIT_ADDR(GPIOE_IDR_Addr, 15) //输入
//-------------
#define PF0    BIT_ADDR(GPIOF_ODR_Addr, 0) //输出
#define PF1    BIT_ADDR(GPIOF_ODR_Addr, 1) //输出
#define PF2    BIT_ADDR(GPIOF_ODR_Addr, 2) //输出
#define PF3    BIT_ADDR(GPIOF_ODR_Addr, 3) //输出
#define PF4    BIT_ADDR(GPIOF_ODR_Addr, 4) //输出
#define PF5    BIT_ADDR(GPIOF_ODR_Addr, 5) //输出
#define PF6    BIT_ADDR(GPIOF_ODR_Addr, 6) //输出
#define PF7    BIT_ADDR(GPIOF_ODR_Addr, 7) //输出
#define PF8    BIT_ADDR(GPIOF_ODR_Addr, 8) //输出
#define PF9    BIT_ADDR(GPIOF_ODR_Addr, 9) //输出
#define PF10   BIT_ADDR(GPIOF_ODR_Addr, 10) //输出
#define PF11   BIT_ADDR(GPIOF_ODR_Addr, 11) //输出
#define PF12   BIT_ADDR(GPIOF_ODR_Addr, 12) //输出
#define PF13   BIT_ADDR(GPIOF_ODR_Addr, 13) //输出
#define PF14   BIT_ADDR(GPIOF_ODR_Addr, 14) //输出
#define PF15   BIT_ADDR(GPIOF_ODR_Addr, 15) //输出
#define PF0in  BIT_ADDR(GPIOF_IDR_Addr, 0) //输入
#define PF1in  BIT_ADDR(GPIOF_IDR_Addr, 1) //输入
#define PF2in  BIT_ADDR(GPIOF_IDR_Addr, 2) //输入
#define PF3in  BIT_ADDR(GPIOF_IDR_Addr, 3) //输入
#define PF4in  BIT_ADDR(GPIOF_IDR_Addr, 4) //输入
#define PF5in  BIT_ADDR(GPIOF_IDR_Addr, 5) //输入
#define PF6in  BIT_ADDR(GPIOF_IDR_Addr, 6) //输入
#define PF7in  BIT_ADDR(GPIOF_IDR_Addr, 7) //输入
#define PF8in  BIT_ADDR(GPIOF_IDR_Addr, 8) //输入
#define PF9in  BIT_ADDR(GPIOF_IDR_Addr, 9) //输入
#define PF10in BIT_ADDR(GPIOF_IDR_Addr, 10) //输入
#define PF11in BIT_ADDR(GPIOF_IDR_Addr, 11) //输入
#define PF12in BIT_ADDR(GPIOF_IDR_Addr, 12) //输入
#define PF13in BIT_ADDR(GPIOF_IDR_Addr, 13) //输入
#define PF14in BIT_ADDR(GPIOF_IDR_Addr, 14) //输入
#define PF15in BIT_ADDR(GPIOF_IDR_Addr, 15) //输入
//-------------
#define PG0    BIT_ADDR(GPIOG_ODR_Addr, 0) //输出
#define PG1    BIT_ADDR(GPIOG_ODR_Addr, 1) //输出
#define PG2    BIT_ADDR(GPIOG_ODR_Addr, 2) //输出
#define PG3    BIT_ADDR(GPIOG_ODR_Addr, 3) //输出
#define PG4    BIT_ADDR(GPIOG_ODR_Addr, 4) //输出
#define PG5    BIT_ADDR(GPIOG_ODR_Addr, 5) //输出
#define PG6    BIT_ADDR(GPIOG_ODR_Addr, 6) //输出
#define PG7    BIT_ADDR(GPIOG_ODR_Addr, 7) //输出
#define PG8    BIT_ADDR(GPIOG_ODR_Addr, 8) //输出
#define PG9    BIT_ADDR(GPIOG_ODR_Addr, 9) //输出
#define PG10   BIT_ADDR(GPIOG_ODR_Addr, 10) //输出
#define PG11   BIT_ADDR(GPIOG_ODR_Addr, 11) //输出
#define PG12   BIT_ADDR(GPIOG_ODR_Addr, 12) //输出
#define PG13   BIT_ADDR(GPIOG_ODR_Addr, 13) //输出
#define PG14   BIT_ADDR(GPIOG_ODR_Addr, 14) //输出
#define PG15   BIT_ADDR(GPIOG_ODR_Addr, 15) //输出
#define PG0in  BIT_ADDR(GPIOG_IDR_Addr, 0) //输入
#define PG1in  BIT_ADDR(GPIOG_IDR_Addr, 1) //输入
#define PG2in  BIT_ADDR(GPIOG_IDR_Addr, 2) //输入
#define PG3in  BIT_ADDR(GPIOG_IDR_Addr, 3) //输入
#define PG4in  BIT_ADDR(GPIOG_IDR_Addr, 4) //输入
#define PG5in  BIT_ADDR(GPIOG_IDR_Addr, 5) //输入
#define PG6in  BIT_ADDR(GPIOG_IDR_Addr, 6) //输入
#define PG7in  BIT_ADDR(GPIOG_IDR_Addr, 7) //输入
#define PG8in  BIT_ADDR(GPIOG_IDR_Addr, 8) //输入
#define PG9in  BIT_ADDR(GPIOG_IDR_Addr, 9) //输入
#define PG10in BIT_ADDR(GPIOG_IDR_Addr, 10) //输入
#define PG11in BIT_ADDR(GPIOG_IDR_Addr, 11) //输入
#define PG12in BIT_ADDR(GPIOG_IDR_Addr, 12) //输入
#define PG13in BIT_ADDR(GPIOG_IDR_Addr, 13) //输入
#define PG14in BIT_ADDR(GPIOG_IDR_Addr, 14) //输入
#define PG15in BIT_ADDR(GPIOG_IDR_Addr, 15) //输入

/*******************P口16个IO口同时动作********************************/
#define PA   MEM_ADDR(GPIOA_ODR_Addr)          //PA  16个IO口同时动作
#define PB   MEM_ADDR(GPIOB_ODR_Addr) 
#define PC   MEM_ADDR(GPIOC_ODR_Addr) 
#define PD   MEM_ADDR(GPIOD_ODR_Addr)      
#define PE   MEM_ADDR(GPIOE_ODR_Addr) 
#define PF   MEM_ADDR(GPIOF_ODR_Addr) 
#define PG   MEM_ADDR(GPIOG_ODR_Addr) 
#define PAin MEM_ADDR(GPIOA_IDR_Addr) 
#define PBin MEM_ADDR(GPIOB_IDR_Addr) 
#define PCin MEM_ADDR(GPIOC_IDR_Addr) 
#define PDin MEM_ADDR(GPIOD_IDR_Addr) 
#define PEin MEM_ADDR(GPIOE_IDR_Addr) 
#define PFin MEM_ADDR(GPIOF_IDR_Addr) 
#define PGin MEM_ADDR(GPIOG_IDR_Addr) 
/***********************************************************************/

/*****************SW/JTAG引脚功能设置*****************/
#define SWJ_ON()       { RCC->APB2ENR|=0x00000001;AFIO->MAPR=(AFIO->MAPR&0xF8FFFFFF); }
#define SWJ_NOJNTRST() { RCC->APB2ENR|=0x00000001;AFIO->MAPR=(AFIO->MAPR&0xF8FFFFFF)|(1<<24); } 
#define SWON_JTAGOFF() { RCC->APB2ENR|=0x00000001;AFIO->MAPR=(AFIO->MAPR&0xF8FFFFFF)|(1<<25); } 
#define SWJ_OFF()      { RCC->APB2ENR|=0x00000001;AFIO->MAPR=(AFIO->MAPR&0xF8FFFFFF)|(1<<26); }  

#endif
